# 1) Ввести массив, состоящий из 9 элементов (девять двузначных чисел в
#    восьмеричной системе счисления) . Сформировать новый массив путем
#    перевода значений элементов исходного массива в десятичную систему
#    счисления.
import random

A = []
i = 0
print("Enter value of the list: ")
while i < 9:
    A.append(random.randrange(10, 100))
    i += 1
i = 0
while i < 9:
    if A[i] % 10 == 8:
        A[i] = A[i] - 1
    if A[i] % 10 == 9:
        A[i] = A[i] - 2
    if A[i] // 10 == 8:
        A[i] = A[i] - 10
    if A[i] // 10 == 9:
        A[i] = A[i] - 20
    i += 1
print(f'Массив восьмеричной системе счисления: {A}')
i = 0
for item in A:
    A[i] = (item // 10) * 8 + (item % 10)
    # A[i] = item
    i += 1
print(f'Массив десятичную системе счисления: {A}')
